"""金陵十二钗前五位"""

"""第一种方式"""
name1 = '林黛玉'
name2 = '薛宝钗'
name3 = '贾元春'
name4 = '贾探春'
name5 = '史湘云'
print('❶\t' + name1)
print('❷\t' + name2)
print('❸\t' + name3)
print('❹\t' + name4)
print('❺\t' + name5)
print('_________________________________________')

"""+++++++++++++++++++++++++++++++第二种方式，利用列表【】++++++++++++++++++++++++"""
lst_name = ['林黛玉', '薛宝钗', '贾元春', '贾探春', '史湘云']
lst_sig = ['❶', '❷', '❸', '❹', '❺']
for i in range(5):
    print(lst_sig[i], lst_name[i])

print('_________________________________________')

'''++++++++++++++++++++++++++++++第三总方法，利用字典++++++++++++++++++++++++++++++'''
d = {'❶': '林黛玉', '❷': '薛宝钗', '❸': '贾元春', '❹': '贾探春', '❺': '史湘云'}
# print(d['❶'])
# print(type(d['❶']))
for item in d:  # 字典的遍历 是遍历的 key 值 ！！！
    print(item, d[item])

print('_________________________________________')

"""++++++++++++++++++++++++++++++++++第四种方法 zip方法！！+++++++++++++++++++++++++++++++++++"""
for s, name in zip(lst_sig, lst_name):
    print(s, name)

print('_________________________________________')