"""Jyl 代码编写"""
dict_ticket = {'G1569': ['北京南--天津南', '18:05', '18:39', '00:34'],
               'G1567': ['北京南--天津南', '18:11', '18:45', '00:35'],
               'G8917': ['北京南--天津南', '18:20', '19:19', '00:59'],
               'G203': [' 北京南--天津南', '18:35', '18:09', '00:34']
               }
print('车次\t\t出发站-到达站\t\t出发时间\t\t到达时间\t\t历时时长')
for key in dict_ticket:
    print(key, end='  ')  # 遍历输出是 换行显示，每行显示一条内容，加了 end=' '后可以不用换行显示输出
    for value in dict_ticket[key]:
        print(value, end='       ')
    print()  # 换行

# 输入要购买的车次
train_num = input('请输入要购买的车次：')
train_per = input('请输入乘车人，如果是多人请用逗号分割：')
s1 = f'您已购买了{train_num}次列车'
s2 = f'请{train_per}尽快到检票口'  # 格式化字符串在大括号内写入变量后会自动在前头添加 f
print(s1 + s2)
